import { useState } from 'react';
import styles from './YearReview.module.css';
import Sidebar from './Sidebar';
import BulletPoints from './BulletPoints';

const sections = {
  retrospective: {
    title: 'Этап 1. Ретроспектива года',
    subtitle: '',
    points: [
      {
        title:
          'О чем вы будете думать, когда вспомните 2024 год через 10-15-20 лет',
      },
      {
        title:
          'Что важного вы сделали в этом году? А для себя? В чем важность этих событий для вас?',
      },
      {
        title: 'Выпишите 5 уроков этого года. Что они значат для вас?',
      },
      {
        title: 'Что вы поняли о себе?',
      },
      {
        title: 'Что хотите оставить в ушедшем году навсегда?',
      },
      {
        title: 'Что заберете в будущий год?',
      },
      {
        title: 'В чем ваши сильные стороны, которые помогут двигаться дальше?',
      },
      {
        title: 'Главные слова этого года',
      },
    ],
  },
  'long-term': {
    title: 'Этап 2. Долгосрочная цель',
    subtitle:
      'Представьте, что вы заглянули в замочную скважину и увидели свою жизнь через 10 лет. <br /> Что вы там видите?',
    points: [
      {
        title:
          'Где вы? Что это за место? Какой вы там? Какие люди вас окружают? Что вы слышите, чувствуете?',
      },
      {
        title:
          'Что вы делаете там в моменте? Чем вы в целом занимаетесь там в жизни?',
      },
      {
        title:
          'Что вы там умеете? Чему научились за 10 лет? Какой опыт приобрели?',
      },
      {
        title: 'Что самое важное есть в вашей жизни через 10 лет?',
      },
      {
        title: 'Опишите свое душевное состояние там. Какой вы там?',
      },
      {
        title: 'Что важного вы делаете для этого мира?',
      },
      {
        title:
          'Оторвитесь от замочной скважины, вернитесь в наше время. Какие мысли приходят в голову? Как бы вы сформулировали свою цель на 10 лет?',
      },
    ],
  },
  'long-term-2': {
    title: 'Этап 3. Мысли о 2025 годе',
    subtitle: 'А теперь представьте, что наступил декабрь 2025 года',
    points: [
      { title: 'Опишите, что изменилось в вас за этот год?' },
      { title: 'Как эти изменения связаны с вашей целью на 10 лет?' },
      { title: 'Как изменилась ваша жизнь?' },
      { title: 'Что новое произошло в работе?' },
      {
        title:
          'Если описать все изменения за 2025 год, как можно их сформулировать в 1-2 предложениях?',
      },
      { title: 'Какие 10 шагов нужно сделать в первую очередь за 2025 год?' },
      {
        title: 'Сформулируйте цель на 2025 год максимально конкретно по SMART',
      },
    ],
  },
  letter: {
    title: 'Письмо Деду Морозу',
    subtitle: '',
    points: [
      {
        title: 'В этом году я...',
        subtitle:
          '(опишите коротко, что вы поняли из ретроспективы года, похвалите себя, отметьте сильные стороны и уроки года)',
      },
      {
        title: 'Вообще я хочу в жизни достичь...',
        subtitle: '(опишите вашу мечту, но постарайтесь конкретизировать ее)',
      },
      {
        title: 'Сделай так, чтобы в 2025 года у меня было...',
        subtitle: '(поставьте цель по SMART)',
      },
      {
        title: 'А я для этого сделаю',
        subtitle: '(напишите 10 шагов на ближайшее время)',
      },
      {
        title:
          'Загадайте желание коротким предложением, чтобы произнести его под бой курантов',
      },
    ],
  },
  summary: {
    title: 'Итак, на сегодняшнем практикуме мы с вами',
    subtitle: '',
    points: [
      {
        title: 'Разобрали итоги года',
      },
      { title: 'Сформулировали долгосрочная цель' },
      { title: 'Поставили цель на 2025 год' },
      { title: 'и окунулись в детство!' },
      {
        title:
          'Еще раз проанализируйте все пункты до 31.12.2024, а потом детально проработайте их в начале года',
      },
    ],
  },
};

export default function YearReview() {
  const [activeSection, setActiveSection] = useState<
    'retrospective' | 'long-term' | 'long-term-2' | 'letter' | 'summary'
  >('retrospective');

  return (
    <div className={styles.container}>
      <Sidebar
        sections={sections}
        activeSection={activeSection}
        onSectionChange={(section) =>
          setActiveSection(section as keyof typeof sections)
        }
      />
      <div className={styles.content}>
        <BulletPoints
          title={sections[activeSection].title}
          subtitle={sections[activeSection].subtitle ?? ''}
          points={sections[activeSection].points}
          pageId={activeSection}
        />
      </div>
    </div>
  );
}
